reports/stage3/sync/wrkLogsGet.txt
Running 25s test @ http://localhost:8080
  1 threads and 65 connections
  Thread calibration: mean lat.: 7.614ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.49ms   33.05ms 455.94ms   93.16%
    Req/Sec     6.08k     1.02k   14.09k    85.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.36ms
 75.000%    7.24ms
 90.000%   31.58ms
 99.000%  173.95ms
 99.900%  369.92ms
 99.990%  445.70ms
 99.999%  455.93ms
100.000%  456.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.942     0.100000         8825         1.11
       1.255     0.200000        17612         1.25
       1.557     0.300000        26417         1.43
       1.912     0.400000        35228         1.67
       2.363     0.500000        44041         2.00
       2.665     0.550000        48440         2.22
       3.101     0.600000        52843         2.50
       3.777     0.650000        57238         2.86
       4.991     0.700000        61639         3.33
       7.239     0.750000        66036         4.00
       8.935     0.775000        68241         4.44
      11.199     0.800000        70439         5.00
      14.295     0.825000        72645         5.71
      18.239     0.850000        74842         6.67
      23.679     0.875000        77046         8.00
      27.439     0.887500        78147         8.89
      31.599     0.900000        79245        10.00
      36.575     0.912500        80348        11.43
      42.239     0.925000        81445        13.33
      49.119     0.937500        82545        16.00
      53.311     0.943750        83100        17.78
      58.143     0.950000        83646        20.00
      64.095     0.956250        84195        22.86
      71.615     0.962500        84747        26.67
      80.831     0.968750        85297        32.00
      86.271     0.971875        85573        35.56
      93.567     0.975000        85849        40.00
     102.271     0.978125        86121        45.71
     115.903     0.981250        86399        53.33
     131.711     0.984375        86672        64.00
     140.671     0.985938        86809        71.11
     151.807     0.987500        86948        80.00
     163.967     0.989062        87084        91.43
     181.759     0.990625        87223       106.67
     198.655     0.992188        87360       128.00
     208.511     0.992969        87428       142.22
     222.591     0.993750        87497       160.00
     236.543     0.994531        87566       182.86
     249.215     0.995313        87635       213.33
     268.799     0.996094        87704       256.00
     277.503     0.996484        87741       284.44
     283.903     0.996875        87772       320.00
     290.815     0.997266        87809       365.71
     304.383     0.997656        87841       426.67
     318.207     0.998047        87876       512.00
     326.143     0.998242        87893       568.89
     336.127     0.998437        87910       640.00
     345.855     0.998633        87927       731.43
     359.679     0.998828        87944       853.33
     372.479     0.999023        87962      1024.00
     376.831     0.999121        87970      1137.78
     382.719     0.999219        87979      1280.00
     387.071     0.999316        87987      1462.86
     395.007     0.999414        87996      1706.67
     400.895     0.999512        88005      2048.00
     403.199     0.999561        88009      2275.56
     408.575     0.999609        88013      2560.00
     410.879     0.999658        88017      2925.71
     419.583     0.999707        88022      3413.33
     423.423     0.999756        88026      4096.00
     428.287     0.999780        88028      4551.11
     433.151     0.999805        88030      5120.00
     436.991     0.999829        88032      5851.43
     440.831     0.999854        88035      6826.67
     443.391     0.999878        88037      8192.00
     445.695     0.999890        88038      9102.22
     446.975     0.999902        88039     10240.00
     447.231     0.999915        88040     11702.86
     451.071     0.999927        88041     13653.33
     451.327     0.999939        88042     16384.00
     451.839     0.999945        88043     18204.44
     451.839     0.999951        88043     20480.00
     452.351     0.999957        88044     23405.71
     452.351     0.999963        88044     27306.67
     454.655     0.999969        88045     32768.00
     454.655     0.999973        88045     36408.89
     454.655     0.999976        88045     40960.00
     455.935     0.999979        88046     46811.43
     455.935     0.999982        88046     54613.33
     455.935     0.999985        88046     65536.00
     455.935     0.999986        88046     72817.78
     455.935     0.999988        88046     81920.00
     456.191     0.999989        88047     93622.86
     456.191     1.000000        88047          inf
#[Mean    =       12.491, StdDeviation   =       33.048]
#[Max     =      455.936, Total count    =        88047]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.28ms
 75.000%    4.48ms
 90.000%   10.69ms
 99.000%   24.14ms
 99.900%   36.51ms
 99.990%   48.80ms
 99.999%   53.82ms
100.000%   56.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.037     0.000000            1         1.00
       0.356     0.100000         8821         1.11
       0.532     0.200000        17619         1.25
       0.706     0.300000        26430         1.43
       0.934     0.400000        35225         1.67
       1.281     0.500000        44027         2.00
       1.530     0.550000        48428         2.22
       1.878     0.600000        52837         2.50
       2.407     0.650000        57234         2.86
       3.225     0.700000        61634         3.33
       4.479     0.750000        66047         4.00
       5.303     0.775000        68239         4.44
       6.215     0.800000        70441         5.00
       7.219     0.825000        72641         5.71
       8.279     0.850000        74845         6.67
       9.407     0.875000        77051         8.00
      10.031     0.887500        78147         8.89
      10.695     0.900000        79243        10.00
      11.471     0.912500        80356        11.43
      12.279     0.925000        81459        13.33
      13.295     0.937500        82554        16.00
      13.887     0.943750        83103        17.78
      14.495     0.950000        83645        20.00
      15.231     0.956250        84196        22.86
      16.111     0.962500        84746        26.67
      17.215     0.968750        85297        32.00
      17.887     0.971875        85576        35.56
      18.575     0.975000        85850        40.00
      19.343     0.978125        86121        45.71
      20.239     0.981250        86399        53.33
      21.343     0.984375        86672        64.00
      22.015     0.985938        86810        71.11
      22.735     0.987500        86949        80.00
      23.519     0.989062        87085        91.43
      24.591     0.990625        87222       106.67
      25.615     0.992188        87360       128.00
      26.047     0.992969        87428       142.22
      26.575     0.993750        87497       160.00
      27.279     0.994531        87566       182.86
      27.999     0.995313        87635       213.33
      29.055     0.996094        87704       256.00
      29.551     0.996484        87739       284.44
      29.999     0.996875        87772       320.00
      30.719     0.997266        87807       365.71
      31.743     0.997656        87842       426.67
      32.623     0.998047        87877       512.00
      33.215     0.998242        87894       568.89
      33.951     0.998437        87910       640.00
      34.719     0.998633        87928       731.43
      35.583     0.998828        87945       853.33
      36.607     0.999023        87962      1024.00
      37.311     0.999121        87971      1137.78
      37.727     0.999219        87979      1280.00
      38.143     0.999316        87988      1462.86
      39.583     0.999414        87996      1706.67
      40.703     0.999512        88005      2048.00
      41.439     0.999561        88009      2275.56
      41.759     0.999609        88013      2560.00
      42.207     0.999658        88017      2925.71
      44.351     0.999707        88022      3413.33
      44.895     0.999756        88026      4096.00
      46.047     0.999780        88029      4551.11
      46.079     0.999805        88030      5120.00
      47.551     0.999829        88032      5851.43
      48.415     0.999854        88035      6826.67
      48.543     0.999878        88037      8192.00
      48.799     0.999890        88038      9102.22
      49.695     0.999902        88039     10240.00
      50.335     0.999915        88040     11702.86
      50.527     0.999927        88041     13653.33
      50.559     0.999939        88042     16384.00
      51.071     0.999945        88043     18204.44
      51.071     0.999951        88043     20480.00
      51.487     0.999957        88044     23405.71
      51.487     0.999963        88044     27306.67
      53.311     0.999969        88045     32768.00
      53.311     0.999973        88045     36408.89
      53.311     0.999976        88045     40960.00
      53.823     0.999979        88046     46811.43
      53.823     0.999982        88046     54613.33
      53.823     0.999985        88046     65536.00
      53.823     0.999986        88046     72817.78
      53.823     0.999988        88046     81920.00
      55.999     0.999989        88047     93622.86
      55.999     1.000000        88047          inf
#[Mean    =        3.645, StdDeviation   =        5.196]
#[Max     =       55.968, Total count    =        88047]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149062 requests in 25.00s, 9.24MB read
Requests/sec:   5962.54
Transfer/sec:    378.48KB